
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_eventgrid_topic.mig-scan-topic[0]
  * azurerm_eventgrid_topic.mig-scanner[0]
  * azurerm_storage_blob.migration-st[0]
* Update
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
* Replace
  * azurerm_log_analytics_workspace.migration-analytics[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_topic.mig-scan-topic[0] will be created
  + resource "azurerm_eventgrid_topic" "mig-scan-topic" {
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + input_schema                  = "EventGridSchema"
      + local_auth_enabled            = true
      + location                      = "uksouth"
      + name                          = "mig-scan-output"
      + primary_access_key            = (sensitive value)
      + public_network_access_enabled = true
      + resource_group_name           = "darts-migration-prod-rg"
      + secondary_access_key          = (sensitive value)
    }

  # azurerm_eventgrid_topic.mig-scanner[0] will be created
  + resource "azurerm_eventgrid_topic" "mig-scanner" {
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + input_schema                  = "EventGridSchema"
      + local_auth_enabled            = true
      + location                      = "uksouth"
      + name                          = "mig-scanner"
      + primary_access_key            = (sensitive value)
      + public_network_access_enabled = true
      + resource_group_name           = "darts-migration-prod-rg"
      + secondary_access_key          = (sensitive value)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] must be replaced
-/+ resource "azurerm_log_analytics_workspace" "migration-analytics" {
      - cmk_for_query_forced                    = false -> null
      ~ id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace" -> (known after apply)
      - immediate_data_purge_on_30_days_enabled = false -> null
      ~ name                                    = "darts-migration-analytics-workspace" -> "darts-migration-analytics-workspace2" # forces replacement
      ~ primary_shared_key                      = (sensitive value)
      ~ secondary_shared_key                    = (sensitive value)
      - tags                                    = {
          - "application"  = "darts"
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea" = "Cross-Cutting"
          - "environment"  = "production"
        } -> null
      ~ workspace_id                            = "635456f5-7d36-4374-ae75-e195cf257785" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                          = "darts-prod-rsv"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.migration-st[0] will be created
  + resource "azurerm_storage_blob" "migration-st" {
      + access_tier            = (known after apply)
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "darts-migration-blob-st-prod"
      + parallelism            = 8
      + size                   = 0
      + storage_account_name   = "saproddartsmig02"
      + storage_container_name = "darts-migration"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Storage/storageAccounts/saproddartsmig02"
        name                              = "saproddartsmig02"
        tags                              = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "82.132.223.245",
              - "94.10.67.157",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":209,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->